performance/axis2/data/receiveSimpleEvents-100.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:receiveSimpleEvents xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input><ns1:sequenceNumber>0</ns1:sequenceNumber><ns1:timestamp>0.0</ns1:timestamp><ns1:message>Message #0</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>1</ns1:sequenceNumber><ns1:timestamp>1.0</ns1:timestamp><ns1:message>Message #1</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>2</ns1:sequenceNumber><ns1:timestamp>1.4142135623730951</ns1:timestamp><ns1:message>Message #2</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>3</ns1:sequenceNumber><ns1:timestamp>1.7320508075688772</ns1:timestamp><ns1:message>Message #3</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>4</ns1:sequenceNumber><ns1:timestamp>2.0</ns1:timestamp><ns1:message>Message #4</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>5</ns1:sequenceNumber><ns1:timestamp>2.23606797749979</ns1:timestamp><ns1:message>Message #5</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>6</ns1:sequenceNumber><ns1:timestamp>2.449489742783178</ns1:timestamp><ns1:message>Message #6</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>7</ns1:sequenceNumber><ns1:timestamp>2.6457513110645907</ns1:timestamp><ns1:message>Message #7</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>8</ns1:sequenceNumber><ns1:timestamp>2.8284271247461903</ns1:timestamp><ns1:message>Message #8</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>9</ns1:sequenceNumber><ns1:timestamp>3.0</ns1:timestamp><ns1:message>Message #9</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>10</ns1:sequenceNumber><ns1:timestamp>3.1622776601683795</ns1:timestamp><ns1:message>Message #10</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>11</ns1:sequenceNumber><ns1:timestamp>3.3166247903554</ns1:timestamp><ns1:message>Message #11</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>12</ns1:sequenceNumber><ns1:timestamp>3.4641016151377544</ns1:timestamp><ns1:message>Message #12</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>13</ns1:sequenceNumber><ns1:timestamp>3.605551275463989</ns1:timestamp><ns1:message>Message #13</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>14</ns1:sequenceNumber><ns1:timestamp>3.7416573867739413</ns1:timestamp><ns1:message>Message #14</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>15</ns1:sequenceNumber><ns1:timestamp>3.872983346207417</ns1:timestamp><ns1:message>Message #15</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>16</ns1:sequenceNumber><ns1:timestamp>4.0</ns1:timestamp><ns1:message>Message #16</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>17</ns1:sequenceNumber><ns1:timestamp>4.123105625617661</ns1:timestamp><ns1:message>Message #17</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>18</ns1:sequenceNumber><ns1:timestamp>4.242640687119285</ns1:timestamp><ns1:message>Message #18</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>19</ns1:sequenceNumber><ns1:timestamp>4.358898943540674</ns1:timestamp><ns1:message>Message #19</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>20</ns1:sequenceNumber><ns1:timestamp>4.47213595499958</ns1:timestamp><ns1:message>Message #20</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>21</ns1:sequenceNumber><ns1:timestamp>4.58257569495584</ns1:timestamp><ns1:message>Message #21</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>22</ns1:sequenceNumber><ns1:timestamp>4.69041575982343</ns1:timestamp><ns1:message>Message #22</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>23</ns1:sequenceNumber><ns1:timestamp>4.795831523312719</ns1:timestamp><ns1:message>Message #23</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>24</ns1:sequenceNumber><ns1:timestamp>4.898979485566356</ns1:timestamp><ns1:message>Message #24</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>25</ns1:sequenceNumber><ns1:timestamp>5.0</ns1:timestamp><ns1:message>Message #25</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>26</ns1:sequenceNumber><ns1:timestamp>5.0990195135927845</ns1:timestamp><ns1:message>Message #26</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>27</ns1:sequenceNumber><ns1:timestamp>5.196152422706632</ns1:timestamp><ns1:message>Message #27</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>28</ns1:sequenceNumber><ns1:timestamp>5.291502622129181</ns1:timestamp><ns1:message>Message #28</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>29</ns1:sequenceNumber><ns1:timestamp>5.385164807134504</ns1:timestamp><ns1:message>Message #29</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>30</ns1:sequenceNumber><ns1:timestamp>5.477225575051661</ns1:timestamp><ns1:message>Message #30</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>31</ns1:sequenceNumber><ns1:timestamp>5.5677643628300215</ns1:timestamp><ns1:message>Message #31</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>32</ns1:sequenceNumber><ns1:timestamp>5.656854249492381</ns1:timestamp><ns1:message>Message #32</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>33</ns1:sequenceNumber><ns1:timestamp>5.744562646538029</ns1:timestamp><ns1:message>Message #33</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>34</ns1:sequenceNumber><ns1:timestamp>5.830951894845301</ns1:timestamp><ns1:message>Message #34</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>35</ns1:sequenceNumber><ns1:timestamp>5.916079783099616</ns1:timestamp><ns1:message>Message #35</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>36</ns1:sequenceNumber><ns1:timestamp>6.0</ns1:timestamp><ns1:message>Message #36</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>37</ns1:sequenceNumber><ns1:timestamp>6.082762530298219</ns1:timestamp><ns1:message>Message #37</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>38</ns1:sequenceNumber><ns1:timestamp>6.164414002968976</ns1:timestamp><ns1:message>Message #38</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>39</ns1:sequenceNumber><ns1:timestamp>6.244997998398398</ns1:timestamp><ns1:message>Message #39</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>40</ns1:sequenceNumber><ns1:timestamp>6.324555320336759</ns1:timestamp><ns1:message>Message #40</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>41</ns1:sequenceNumber><ns1:timestamp>6.4031242374328485</ns1:timestamp><ns1:message>Message #41</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>42</ns1:sequenceNumber><ns1:timestamp>6.48074069840786</ns1:timestamp><ns1:message>Message #42</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>43</ns1:sequenceNumber><ns1:timestamp>6.557438524302</ns1:timestamp><ns1:message>Message #43</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>44</ns1:sequenceNumber><ns1:timestamp>6.6332495807108</ns1:timestamp><ns1:message>Message #44</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>45</ns1:sequenceNumber><ns1:timestamp>6.708203932499369</ns1:timestamp><ns1:message>Message #45</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>46</ns1:sequenceNumber><ns1:timestamp>6.782329983125268</ns1:timestamp><ns1:message>Message #46</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>47</ns1:sequenceNumber><ns1:timestamp>6.855654600401044</ns1:timestamp><ns1:message>Message #47</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>48</ns1:sequenceNumber><ns1:timestamp>6.928203230275509</ns1:timestamp><ns1:message>Message #48</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>49</ns1:sequenceNumber><ns1:timestamp>7.0</ns1:timestamp><ns1:message>Message #49</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>50</ns1:sequenceNumber><ns1:timestamp>7.0710678118654755</ns1:timestamp><ns1:message>Message #50</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>51</ns1:sequenceNumber><ns1:timestamp>7.14142842854285</ns1:timestamp><ns1:message>Message #51</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>52</ns1:sequenceNumber><ns1:timestamp>7.211102550927978</ns1:timestamp><ns1:message>Message #52</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>53</ns1:sequenceNumber><ns1:timestamp>7.280109889280518</ns1:timestamp><ns1:message>Message #53</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>54</ns1:sequenceNumber><ns1:timestamp>7.3484692283495345</ns1:timestamp><ns1:message>Message #54</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>55</ns1:sequenceNumber><ns1:timestamp>7.416198487095663</ns1:timestamp><ns1:message>Message #55</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>56</ns1:sequenceNumber><ns1:timestamp>7.483314773547883</ns1:timestamp><ns1:message>Message #56</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>57</ns1:sequenceNumber><ns1:timestamp>7.54983443527075</ns1:timestamp><ns1:message>Message #57</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>58</ns1:sequenceNumber><ns1:timestamp>7.615773105863909</ns1:timestamp><ns1:message>Message #58</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>59</ns1:sequenceNumber><ns1:timestamp>7.681145747868608</ns1:timestamp><ns1:message>Message #59</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>60</ns1:sequenceNumber><ns1:timestamp>7.745966692414834</ns1:timestamp><ns1:message>Message #60</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>61</ns1:sequenceNumber><ns1:timestamp>7.810249675906654</ns1:timestamp><ns1:message>Message #61</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>62</ns1:sequenceNumber><ns1:timestamp>7.874007874011811</ns1:timestamp><ns1:message>Message #62</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>63</ns1:sequenceNumber><ns1:timestamp>7.937253933193772</ns1:timestamp><ns1:message>Message #63</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>64</ns1:sequenceNumber><ns1:timestamp>8.0</ns1:timestamp><ns1:message>Message #64</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>65</ns1:sequenceNumber><ns1:timestamp>8.06225774829855</ns1:timestamp><ns1:message>Message #65</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>66</ns1:sequenceNumber><ns1:timestamp>8.12403840463596</ns1:timestamp><ns1:message>Message #66</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>67</ns1:sequenceNumber><ns1:timestamp>8.18535277187245</ns1:timestamp><ns1:message>Message #67</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>68</ns1:sequenceNumber><ns1:timestamp>8.246211251235321</ns1:timestamp><ns1:message>Message #68</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>69</ns1:sequenceNumber><ns1:timestamp>8.306623862918075</ns1:timestamp><ns1:message>Message #69</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>70</ns1:sequenceNumber><ns1:timestamp>8.366600265340756</ns1:timestamp><ns1:message>Message #70</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>71</ns1:sequenceNumber><ns1:timestamp>8.426149773176359</ns1:timestamp><ns1:message>Message #71</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>72</ns1:sequenceNumber><ns1:timestamp>8.48528137423857</ns1:timestamp><ns1:message>Message #72</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>73</ns1:sequenceNumber><ns1:timestamp>8.54400374531753</ns1:timestamp><ns1:message>Message #73</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>74</ns1:sequenceNumber><ns1:timestamp>8.602325267042627</ns1:timestamp><ns1:message>Message #74</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>75</ns1:sequenceNumber><ns1:timestamp>8.660254037844387</ns1:timestamp><ns1:message>Message #75</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>76</ns1:sequenceNumber><ns1:timestamp>8.717797887081348</ns1:timestamp><ns1:message>Message #76</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>77</ns1:sequenceNumber><ns1:timestamp>8.774964387392123</ns1:timestamp><ns1:message>Message #77</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>78</ns1:sequenceNumber><ns1:timestamp>8.831760866327848</ns1:timestamp><ns1:message>Message #78</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>79</ns1:sequenceNumber><ns1:timestamp>8.888194417315589</ns1:timestamp><ns1:message>Message #79</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>80</ns1:sequenceNumber><ns1:timestamp>8.94427190999916</ns1:timestamp><ns1:message>Message #80</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>81</ns1:sequenceNumber><ns1:timestamp>9.0</ns1:timestamp><ns1:message>Message #81</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>82</ns1:sequenceNumber><ns1:timestamp>9.055385138137417</ns1:timestamp><ns1:message>Message #82</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>83</ns1:sequenceNumber><ns1:timestamp>9.1104335791443</ns1:timestamp><ns1:message>Message #83</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>84</ns1:sequenceNumber><ns1:timestamp>9.16515138991168</ns1:timestamp><ns1:message>Message #84</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>85</ns1:sequenceNumber><ns1:timestamp>9.219544457292887</ns1:timestamp><ns1:message>Message #85</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>86</ns1:sequenceNumber><ns1:timestamp>9.273618495495704</ns1:timestamp><ns1:message>Message #86</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>87</ns1:sequenceNumber><ns1:timestamp>9.327379053088816</ns1:timestamp><ns1:message>Message #87</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>88</ns1:sequenceNumber><ns1:timestamp>9.38083151964686</ns1:timestamp><ns1:message>Message #88</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>89</ns1:sequenceNumber><ns1:timestamp>9.433981132056603</ns1:timestamp><ns1:message>Message #89</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>90</ns1:sequenceNumber><ns1:timestamp>9.486832980505138</ns1:timestamp><ns1:message>Message #90</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>91</ns1:sequenceNumber><ns1:timestamp>9.539392014169456</ns1:timestamp><ns1:message>Message #91</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>92</ns1:sequenceNumber><ns1:timestamp>9.591663046625438</ns1:timestamp><ns1:message>Message #92</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>93</ns1:sequenceNumber><ns1:timestamp>9.643650760992955</ns1:timestamp><ns1:message>Message #93</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>94</ns1:sequenceNumber><ns1:timestamp>9.695359714832659</ns1:timestamp><ns1:message>Message #94</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>95</ns1:sequenceNumber><ns1:timestamp>9.746794344808963</ns1:timestamp><ns1:message>Message #95</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>96</ns1:sequenceNumber><ns1:timestamp>9.797958971132712</ns1:timestamp><ns1:message>Message #96</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>97</ns1:sequenceNumber><ns1:timestamp>9.848857801796104</ns1:timestamp><ns1:message>Message #97</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>98</ns1:sequenceNumber><ns1:timestamp>9.899494936611665</ns1:timestamp><ns1:message>Message #98</ns1:message></ns1:input><ns1:input><ns1:sequenceNumber>99</ns1:sequenceNumber><ns1:timestamp>9.9498743710662</ns1:timestamp><ns1:message>Message #99</ns1:message></ns1:input></ns1:receiveSimpleEvents></soapenv:Body></soapenv:Envelope>